const a = require("axios");
const f = require("fs");
const p = require("path");

module.exports = {
  config: {
    name: "اوامر",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "انس",
    description: "قائمة الأوامر",
    usages: "ا",
    commandCategory: "خدمات",
    cooldowns: 5,
  },
  run: async ({ api }) => {
    const t = p.join(__dirname, "t.jpg");

    const r = await a({
      url: "https://files.catbox.moe/cra7ko.jpg",
      method: "GET",
      responseType: "stream",
    });

    const w = f.createWriteStream(t);
    r.data.pipe(w);

    w.on("finish", () => {
      api.sendMessage(
        {
          body: y,
          attachment: f.createReadStream(t),
        },
        () => {
          f.unlinkSync(t);
        }
      );
    });

    w.on("error", (e) => {
      console.error("خطأ فالصورة:", e);
    });
  },
};

const y = `
✅ مرحبًا بك في بوت ⚡𝓝𝓐𝓓𝓐𝓡⚡، إليك قائمة الأوامر:

╔═════ ◥◣◆◢◤ ═════╗
        الأوامر العامة
╚═════ ◥◣◆◢◤ ═════╝
● /goibot     ● /auto_gpt
● /زيادة      ● /ابلاغ
● /تيد        ● /زخرفة
● /هلب        ● /2024
● /لو خيروك   ● /لاست
● /لوغو       ● /انترو
● /جافا       ● /مستذئب
● /كت         ● /دراما
● /اكشن       ● /عكس
● /اصفعي      ● /اذكار
● /نوبان      ● /هدية
● /موتي       ● /رعب
● /احم        ● /اكتب
● /مسلسلات   ● /مقص
● /نقاط       ● /نيم
● /سلاحي      ● /الرانك
● /حضن 2      ● /الرّانك

╔═════ ◥◣◆◢◤ ═════╗
        أوامر الذكاء الاصطناعي
╚═════ ◥◣◆◢◤ ═════╝
● /تخيل       ● /صور
● /ارسم       ● /جودة
● /قص         ● /إزالة الخلفية
● /تحدث مع الذكاء بـ؟  
● /سمّعني     ● /قولي

╔═════ ◥◣◆◢◤ ═════╗
        أوامر مشرفي الجروب
╚═════ ◥◣◆◢◤ ═════╝
● /طرد        ● /تقييد
● /سكوت       ● /حماية الادمن
● /تصفية

╔═════ ◥◣◆◢◤ ═════╗
        أوامر عامة إضافية
╚═════ ◥◣◆◢◤ ═════╝
● /معلومات حسابك (آيدي)
● /مانهو      ● /فيلم
● /سيم        ● /سكرين
● /حماية اسم المجموعة
● /اوامر      ● /إضافة
● /مجموعتي    ● /بنك
● /رصيد       ● /سرقة
● /خلفية      ● /طوكيو
● /شخصيتي     ● /كهف
● /عمل        ● /رفع
● /رابط       ● /ضرب
● /اطردني     ● /تقرير

╔═════ ◥◣◆◢◤ ═════╗
        أوامر الإدارة (أدمن البوت)
╚═════ ◥◣◆◢◤ ═════╝
● /رست        ● /لوغو
● /adc        ● /ban
● /unban      ● /warn
● /mute       ● /p-المتعة
● /إعادة      ● /غادر
● /مغادرة الكل ● /طلبات
● /ابتيم      ● /الإعدادات
● /تحديث      ● /إشعار

╔═════ ◥◣◆◢◤ ═════╗
        أوامر التسلية
╚═════ ◥◣◆◢◤ ═════╝
● /joke        ● /quote
● /اعلام       ● /عواصم
● /OاوX        ● /سجن
● /شنق         ● /حضن
● /قبلة        ● /الأسرع
● /تفكيك       ● /تجميع
● /مغامرة      ● /اسألني
● /زوجني

╔═════ ◥◣◆◢◤ ═════╗
        المطور: ᎯᏁᎯᏚ ᎯᏞᏚᎯᎡᏫᏌᎡᎥ
╚═════ ◥◣◆◢◤ ═════╝
• ANAS EL 🖥🐦‍⬛🕷  
• تواصل معي: [https://m.me/61572167800906]

『 𝙱𝙾𝚃 𝙽𝙰𝙳𝙰𝚁 』
`;
