const a = require("axios");
const f = require("fs");
const p = require("path");

module.exports = {
  config: {
    name: "اوامر",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "انس",
    description: "قائمة الأوامر",
    usages: "ا",
    commandCategory: "خدمات",
    cooldowns: 5,
  },
  run: async ({ api }) => {
    const t = p.join(__dirname, "t.jpg");

    const r = await a({
      url: "https://files.catbox.moe/cra7ko.jpg",
      method: "GET",
      responseType: "stream",
    });

    const w = f.createWriteStream(t);
    r.data.pipe(w);

    w.on("finish", () => {
      api.sendMessage(
        {
          body: y,
          attachment: f.createReadStream(t),
        },
        () => {
          f.unlinkSync(t);
        }
      );
    });

    w.on("error", (e) => {
      console.error("خطأ فالصورة:", e);
    });
  },
};

const y = `
✅️مرحبا بك في بوت⚡𝓝𝓐𝓓𝓐𝓡⚡إليك قائمة الأوامر █
●/goibot ●/auto_gpt
●/ زيادة ●/ابلاغ ●/تيد ●/زخرفة ●/هلب
●/2024●/ لو خيروك ●لاست●/ لوغو ●/انترو●/ جافا●/مستذئب ●/ كت ●/دراما ●/اكشن ●/عكس●/اصفعي ●/اذكار●/ نوبان ●/هدية ●/موتي●/ رعب ●/احم ●/اكتب●/مسلسلات●/  مقص ●/نقاط /●نيم
●/سلاحي ●/الرانك ●/حضن 2●الرانك

╔═════◥◣◆◢◤═════╗
💡أوامر ذكاء - 
●/تخيل ●/ صور ●/ارسم ●/ جودة  ●/قص ازالة خلفية ●/تحدث مع الذكاء ب؟●/سمعني /●قولي
╚═════◥◣◆◢◤═════╝
✂️ أوامر مشرفي الجروب 
●/طرد ●/تقيد ●/سكوت ●/حماية الادمن●/تصفية 
◆ ━━━━━━━━━━━ ◆
⚙️ أوامر عامة:
● / معلومات عن حسابك[آيدي] معرف الحساب ●/مانهو ●/فليم ●/سيم 
●/ سكرين ●/حماية اسم المجموعة  ●/ 
●/ اوامر●/اضافة ●/ ●/مجموعتي 
●/بنك ●/رصيد ●/سرقة ●/خلفية ●/طوكيو ●/شخصيتي  ●/كهف ●/ عمل ●/ ●/ رفع ●/ رابط ●ضرب ●/اطردني●/تقرير 

◆ ━━━━━━━━━━━ ◆
🛠️ أوامر الإدارة:ادمن البوت  

●/رست ● لوغو ●/adc• /ban - حظر مستخدم
• /unban - إلغاء الحظر
• /warn - تحذير مستخدم
• /mute - كتم مستخدم
●/p-المتعة
●/إعاده /▪︎ غادر /▪︎مغادرة الكل ●/طلبات• /ابتيم●/الاعدادات●/تحديث ●/اشعار ●/ 
◆ ━━━━━━━━━━━ ◆
🎮 أوامر التسلية:
• /joke - نكتة عشوائية
• /quote - اقتباس تحفيزي
●/اعلام ●/عواصم ●/Oاوx-لعبة ●/سجن ●/شنق ●/حضن ●/قبلة ●/ الاسرع ●/تفكيك ●/تجميع ●/مغامرة ●/ اسئلني●/ زوجني 

◆ ━━━━━━━━━━━ ◆
⚡ المطور:ᎯᏁᎯᏚ ᎯᏞᏚᎯᎡᏫᏌᎡᎥ
• ANAS EL 󱢏🖥🐦‍⬛🕷 |تواصل معي عبر: [https://m.me/61572167800906]

╔═════◥◣◆◢◤═════╗
『 𝙱𝙾𝚃 𝙽𝙰𝙳𝙰𝚁 』
╚═════◥◣◆◢◤═════╝

`;
